InformationRegisters/ОбменСAudaPadWeb.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОбменСAudaPadWeb</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Калькуляция</Name>
					<Comment>Данные калькуляции, полученные из Audatex</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучательАХ</Name>
					<Comment>Пользователь, зарегистрированный в Audatex</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор обмена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Comment>Заказ-наряд</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбменСAudaPadWeb/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписьЗначенияРегистраСведения(
	Автор,
	ЗаказНаряд,
	ИдентификаторДела,
	ИдентификаторЗадания,
	Период=Неопределено,
	Калькуляция=Неопределено,
	ПолучательАХ=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Менеджер = РегистрыСведений.ОбменСAudaPadWeb.СоздатьМенеджерЗаписи();
	Менеджер.Период               = ?(Период = Неопределено, ТекущаяДатаСеанса(), Период);
	Менеджер.Автор                = Автор;
	Менеджер.ЗаказНаряд           = ЗаказНаряд;
	Менеджер.ИдентификаторДела    = ИдентификаторДела;
	Менеджер.ИдентификаторЗадания = ИдентификаторЗадания;
	
	Если НЕ Калькуляция = Неопределено Тогда
		Менеджер.Калькуляция = Калькуляция;
	КонецЕсли;
	
	Если НЕ ПолучательАХ = Неопределено Тогда
		Менеджер.ПолучательАХ = ПолучательАХ;
	КонецЕсли;
	
	Менеджер.Записать(Истина);
	
КонецПроцедуры // ЗаписьЗначенияРегистраСведения()

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции 

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли
